# 02. 파이썬 pandas 기초 연습문제

* 코난아카데미 : 데이터분석 기초
* 작성자 : 김무성

# 차례

* 기초
* 응용

In [1]:
import pandas as pd
import numpy as np

## 기초 [1, 2, 3]

* numpy 기초
  - (numpy 기본) 문제 1. ndarray 다루기 (1)
  - (numpy 기본) 문제 2. ndarray 다루기 (2)
  - (numpy 선형대수) 문제 3. 선형방정식 풀기(해 구하기)
* pandas 기초
  - (pandas 기본) 문제 1. DataFrame 다루기 (1)
  - (pandas 기본) 문제 2. DataFrame 다루기 (2)

###  numpy 기초

#### (numpy 기본) 문제 1. ndarray 다루기 (1

##### 다음의 데이터를 사용하시오

In [2]:
ls = [2, 3, 5, 6, 7, 10]

##### a) 데이터 벡터 x를 만드시오

In [3]:
x = np.array(ls)
x

array([ 2,  3,  5,  6,  7, 10])

##### b) 각 데이터의 제곱으로 구성된 벡터 x2를 만드시오

In [4]:
x2 = x **2
x2

array([  4,   9,  25,  36,  49, 100])

##### c) 각 데이터의 제곱의 합을 구하시오

In [5]:
np.sum(x2)

223

##### d) 각 데이터에서 2를 뺀 값을 구하시오

In [6]:
x - 2

array([0, 1, 3, 4, 5, 8])

##### e) 최대값과 최소값을 구하시오

In [7]:
print(np.max(x) , np.min(x))

10 2

##### f) 5보다 큰 값들로만 구성된 데이터 벡터 x_up을 만드시오

In [8]:
print([i for i in x if i > 5])

[6, 7, 10]

##### g) 벡터 x의 길이를 구하시오

In [9]:
len(x)

6

##### h) x'x를 구하시오 (x'는 x의 전치)

In [10]:
np.dot(x.T,x)

223

##### i) xx'를 구하시오

In [11]:
np.dot(x,x.T)

223

##### j) 벡터 x와 x2를 열결합(column bind)하여 xc에 저장하시오

In [12]:
x

array([ 2,  3,  5,  6,  7, 10])

In [13]:
x2

array([  4,   9,  25,  36,  49, 100])

In [14]:
np.vstack((x,x2))

array([[  2,   3,   5,   6,   7,  10],
       [  4,   9,  25,  36,  49, 100]])

##### k) 벡터 x와 x2를 행결합(row bind)하여 xr에 저장하시오

In [15]:
np.hstack((x,x2))

array([  2,   3,   5,   6,   7,  10,   4,   9,  25,  36,  49, 100])

#### (numpy 기본) 문제 2. ndarray 다루기 (2)

##### a ) 표준정규분포를 따르는 난수 100개를 가진 배열 x를 만드시오

In [16]:
x = np.random.randn(100)

##### b) x에서 값이 0.2 보다 큰 원소들을 골라내시오

In [17]:
print([i for i in x if i > 0.2])

[0.5993727111980399, 0.29220809691254396, 0.4211139629792277, 0.9494446338462343, 0.4362034363200943, 1.3598171161942674, 0.6076024810056604, 0.7633093621245101, 2.390874746691497, 0.7539752674612259, 3.228086615592173, 0.7996425072414942, 0.41628170797137226, 0.3147416628497668, 2.3721703310805804, 0.7117665377560949, 1.458582371214783, 0.30083850325506595, 0.24781061789159056, 0.978067130196312, 0.8230107118313312, 1.1011265688865977, 1.660631438283861, 1.5198819123196863, 0.6080034484323176, 1.1235433547505247, 1.925709633211814, 2.1624432598333176, 0.3405214305128235, 1.2183978414143628, 0.2160555687681026, 0.7885100317936391, 0.9035264670395647, 1.581151524431132, 0.7545263143193979, 0.5648730350281637]

#### (numpy 선형대수) 문제 3. 선형방정식 풀기(해 구하기)

##### 다음과 같은 방정식이 있다.

3x + 6y - 5z = 12

x - 3y + 2z = -2

5x - y + 4z = 10

##### a) 위 식을 numpy를 이용해서 Ax=B 형태로 나타내시오 (A와 B만 생성)

In [18]:
A = np.array([[3,6,-5],[1,-3,2],[5,-1,4]])
A

array([[ 3,  6, -5],
       [ 1, -3,  2],
       [ 5, -1,  4]])

In [19]:
B = np.array([12,-2,10])

In [20]:
A.shape , B.shape

((3, 3), (3,))

##### b) A의 역행렬을 구하시오

In [21]:
np.linalg.inv(A)

array([[ 0.15625 ,  0.296875,  0.046875],
       [-0.09375 , -0.578125,  0.171875],
       [-0.21875 , -0.515625,  0.234375]])

##### c) 방정식의 해 벡터 x를 구하시오

In [22]:
np.dot(np.linalg.inv(A),B)

array([1.75, 1.75, 0.75])

### pandas 기초

#### (pandas 기본) 문제 1. DataFrame 다루기 (1)

   | numbers |
----- | ------ 
a  | 10 
b  | 20 
c  | 30 
d  | 40

##### a) DataFrame으로 위와 같은 자료를 만드시오. 컬럼 이름은 numbers, 로우 네임은 a~e, 값은 10~40

In [39]:
df = pd.DataFrame([10,20,30,40],
                  index=['a','b','c','d'],
                  columns=['numbers'])
df

   numbers
a       10
b       20
c       30
d       40

##### b) c 로우의 값을 가져오시오.

In [40]:
df.loc['c']

numbers    30
Name: c, dtype: int64

##### c) a, d 로우들의 값을 가져오시오.

In [41]:
df.loc[['a','d']]

   numbers
a       10
d       40

##### d) numbers의 합을 구하시오.

In [42]:
df.sum()

numbers    100
dtype: int64

##### e) numbers의 값들을 각각 제곱하시오 (vectorized operations 표헌으로 예] 2*v )

###### 이런 결과가 나와야 함.

  | numbers |
----- | ------ 
a  | 100 
b  | 400 
c  | 900 
d  | 1600

In [43]:
df.apply(lambda x: x**2)

   numbers
a      100
b      400
c      900
d     1600

##### f) numbers의 값들을 각각 제곱하시오(apply 메서드 사용해서)

In [44]:
df['numbers'].apply(lambda x: x**2)

a     100
b     400
c     900
d    1600
Name: numbers, dtype: int64

##### f) numbers의 값들을 각각 제곱하시오(apply 메서드에, 람다 함수도 사용해서)

In [45]:
df.apply(lambda x : x**2)

   numbers
a      100
b      400
c      900
d     1600

##### g) floats라는 이름의 칼럼을 추가하시오. 값은 1.5, 2.5, 3.5, 4.5

###### 이런 결과가 나와야 함.

| numbers | floats
----- | ------ | ------
a  | 10 | 1.5
b  | 20 | 2.5
c  | 30 | 3.5
d  | 40 | 4.5

In [46]:
df['floats'] = [i+0.5 for i in range(1,5)]
df

   numbers  floats
a       10     1.5
b       20     2.5
c       30     3.5
d       40     4.5

##### h) names라는 이름의 다음과 같은 칼럼을 위의 결과에 또 추가하시오.

 | names | 
 ----- | ------
 d  | Guido 
 a  | Felix
 b  | Francesc
 c  | Yves

In [47]:
testing_df = pd.DataFrame(['Guido','Felix','Francesc','Yves'],
                          index=['d','a','b','c'],
                          columns=['names'])

In [48]:
df

   numbers  floats
a       10     1.5
b       20     2.5
c       30     3.5
d       40     4.5

In [49]:
testing_df

      names
d     Guido
a     Felix
b  Francesc
c      Yves

In [50]:
df = pd.merge(df,testing_df, left_index=True, right_index=True)

In [51]:
df

   numbers  floats     names
a       10     1.5     Felix
b       20     2.5  Francesc
c       30     3.5      Yves
d       40     4.5     Guido

##### i) 다음과 같은 정보를 가지는 로우(행)를 위의 결과에 추가하시오

index:z, 

numbers: 100, 

floats: 5.75, 

names: Henry

In [55]:
df.loc['z'] = [100, 5.75,'Henry']

In [56]:
df

   numbers  floats     names
a       10    1.50     Felix
b       20    2.50  Francesc
c       30    3.50      Yves
d       40    4.50     Guido
z      100    5.75     Henry

##### j) squares 라는 이름의 칼럼을 위의 결과에 추가하시오. 그런데 squares는 인덱스값이 짝이 맞지 않으므로 join 메서드를 사용하시오(기본옵션으로)

  | squares |
----- | ------ 
a  | 1
b  | 4
c  | 9
d  | 16
y  | 25

In [57]:
testing_df = pd.DataFrame(data=[i**2 for i in range(1,6)],
                          columns=['squares'],
                          index=['a','b','c','d','y'])

In [58]:
testing_df

   squares
a        1
b        4
c        9
d       16
y       25

In [59]:
df

   numbers  floats     names
a       10    1.50     Felix
b       20    2.50  Francesc
c       30    3.50      Yves
d       40    4.50     Guido
z      100    5.75     Henry

In [60]:
pd.merge(df,testing_df, 
         how='inner',
         left_index=True, 
         right_index=True)

   numbers  floats     names  squares
a       10     1.5     Felix        1
b       20     2.5  Francesc        4
c       30     3.5      Yves        9
d       40     4.5     Guido       16

##### k) j와 동일하나 join 메서드의 옵션을 'outer'로 바꿔서 수행해보시오.

In [63]:
pd.merge(df,testing_df, 
         how='outer',
         left_index=True, 
         right_index=True)

   numbers  floats     names  squares
a     10.0    1.50     Felix      1.0
b     20.0    2.50  Francesc      4.0
c     30.0    3.50      Yves      9.0
d     40.0    4.50     Guido     16.0
y      NaN     NaN       NaN     25.0
z    100.0    5.75     Henry      NaN

In [62]:
new_df = pd.merge(df,testing_df, how='outer',left_index=True, right_index=True)
new_df

   numbers  floats     names  squares
a     10.0    1.50     Felix      1.0
b     20.0    2.50  Francesc      4.0
c     30.0    3.50      Yves      9.0
d     40.0    4.50     Guido     16.0
y      NaN     NaN       NaN     25.0
z    100.0    5.75     Henry      NaN

##### l) 위의 결과로 나온 자료에서 numbers 칼럼과 squares 칼럼에 대해, 각각 평균을 구하시오. 다음과 같은 결과가 나와야 함. (mean 메서드 사용, column-wise 계산)

In [ ]:
numbers 40
squares 11

In [66]:
new_df['numbers'].mean()

40.0

In [67]:
new_df['squares'].mean()

11.0

##### m) numbers와 squares 칼럼에 대해, 각각 표준편차를 구하시오 (std 메서드 사용, column-wise 계산)

In [68]:
print(new_df['numbers'].std() , new_df['squares'].std())

35.35533905932738 9.669539802906858

#### (pandas 기본) 문제 2. DataFrame 다루기 (2)

##### a) 표준정규분포를 따르는 9 X 4 형태의 DataFrame을 생성하시오

In [69]:
rand_df = pd.DataFrame(np.random.randn(36).reshape(9,4))
rand_df

          0         1         2         3
0 -0.350668 -0.722271  0.012790 -0.792629
1  0.366956 -0.573115 -0.242530 -1.505367
2  1.284112 -1.431092  0.676385  2.255145
3 -0.207949 -0.656263 -1.208690  0.137673
4  1.139832 -1.036374 -1.616088 -0.430377
5 -0.745572  0.007835 -1.234691 -0.949065
6  1.455116 -0.910608  1.064471  0.307524
7  1.715213 -0.333907 -1.038324  0.810768
8  1.069265  0.526334  0.060627  0.074937

##### b) a에서 생성한 DataFrame의 칼럼 이름을 - No1, No2, No2, No4로 지정하시오

In [70]:
rand_df.columns = ['No1','No2','No3','No4']
rand_df

        No1       No2       No3       No4
0 -0.350668 -0.722271  0.012790 -0.792629
1  0.366956 -0.573115 -0.242530 -1.505367
2  1.284112 -1.431092  0.676385  2.255145
3 -0.207949 -0.656263 -1.208690  0.137673
4  1.139832 -1.036374 -1.616088 -0.430377
5 -0.745572  0.007835 -1.234691 -0.949065
6  1.455116 -0.910608  1.064471  0.307524
7  1.715213 -0.333907 -1.038324  0.810768
8  1.069265  0.526334  0.060627  0.074937

##### e) 위에서 생성된 자료에, 시간 관련 인덱싱을 하기 위해서는 DataTime 자료형을 생성해서 로우 인덱스에 넣어주는 방법이 있다.  아래코드를 실행하시오

In [71]:
# import pandas as pd 라는 가정하에.
dates = pd.date_range('2015-1-1', periods=9, freq='M')
rand_df.index = dates # a와 b를 거쳐서 만들어진 DataFrame 인스턴스의 변수명이 df라고 가정.
rand_df

                 No1       No2       No3       No4
2015-01-31 -0.350668 -0.722271  0.012790 -0.792629
2015-02-28  0.366956 -0.573115 -0.242530 -1.505367
2015-03-31  1.284112 -1.431092  0.676385  2.255145
2015-04-30 -0.207949 -0.656263 -1.208690  0.137673
2015-05-31  1.139832 -1.036374 -1.616088 -0.430377
2015-06-30 -0.745572  0.007835 -1.234691 -0.949065
2015-07-31  1.455116 -0.910608  1.064471  0.307524
2015-08-31  1.715213 -0.333907 -1.038324  0.810768
2015-09-30  1.069265  0.526334  0.060627  0.074937

##### f) 각 컬럼의 평균을 구하시오

In [72]:
rand_df.describe().loc['mean',:]

No1    0.636256
No2   -0.569940
No3   -0.391783
No4   -0.010154
Name: mean, dtype: float64

##### f) 5월부터 7월까지의, 각 컬럼의 평균을 구하시오

In [75]:
rand_df.iloc[[idx for idx, i in enumerate(rand_df.index) if 4 < i.month < 8]].mean()

No1    0.616458
No2   -0.646382
No3   -0.595436
No4   -0.357306
dtype: float64

## 응용

* 응용문제 1 - pandas의 DataFrame을 이용한 엑셀파일 분석
* 응용문제 2 - pandas의 DataFrame을 이용한 주식 데이터 분석 [3]

### 응용문제 1 - pandas의 DataFrame을 이용한 엑셀파일 분석

* 01_data/ex/person.xls 파일을 pandas로 읽어서 DataFrame 자료로 받는다.
* (힌트, 엑셀에서 열어서 csv 포맷으로 바꾸면 훨씬 쉬워진다)

##### 1) score의 평균을 구하기

In [80]:
person_df = pd.read_csv('person.csv',encoding='utf-8')
person_df

   no  id  gender  email     com  score
0   1  ma    male    NaN   naver    100
1   2  fa  female    NaN  google    100
2   3  mb    male    NaN   yahoo     80
3   4  mc    male    NaN    daum     70
4   5  fb  female    NaN    daum     60
5   6  fc  female    NaN   naver     70
6   7  me    male    NaN   yahoo     80
7   8  md    male    NaN   naver    100
8   9  mg    male    NaN   naver     90
9  10  fd  female    NaN   naver     90

##### 2) 남,녀별 score 평균 구하기

In [81]:
person_df.groupby('gender').aggregate({'score':'mean'})

            score
gender
female  80.000000
male    86.666667

##### 3) 각 email의 값은 비워져있다. 채워넣어보자. 이메일은 '아이디@회사이름.com' 규칙을 따른다. 예를들어 id가 user1이고 회사가 naver이면 그 사람의 email은 user1@naver.com 이다.

In [82]:
person_df['email'] = [person_df['id'][i] +'@'+ person_df['com'][i] +'.com'for i in range(len(person_df))]
person_df

   no  id  gender          email     com  score
0   1  ma    male   ma@naver.com   naver    100
1   2  fa  female  fa@google.com  google    100
2   3  mb    male   mb@yahoo.com   yahoo     80
3   4  mc    male    mc@daum.com    daum     70
4   5  fb  female    fb@daum.com    daum     60
5   6  fc  female   fc@naver.com   naver     70
6   7  me    male   me@yahoo.com   yahoo     80
7   8  md    male   md@naver.com   naver    100
8   9  mg    male   mg@naver.com   naver     90
9  10  fd  female   fd@naver.com   naver     90

### 응용문제 2 - pandas의 DataFrame을 이용한 주식 데이터 분석

##### 야후 파이낸스 API를 이용해서 특정 주식의 정보를 받아오는 코드는 아래와 같다.

In [83]:
import pandas as pd
import pandas_datareader.data as web

start_date = '2010-01-01'
end_date = '2016-12-31'
panel_data = web.DataReader('INPX', 'yahoo', start_date, end_date)
# DAX = web.DataReader(name='APPL', data_source='yahoo', start='2000-1-1')
# DAX.info()

##### a) 위의 코드를 실행해서 값을 가져오시오

In [89]:
panel_data.head()

               High      Low     Open    Close  Volume  Adj Close  Diff
Date
2012-08-03  15120.0  15120.0  15120.0  15120.0     0.0    15120.0   0.0
2012-08-06  15120.0  15120.0  15120.0  15120.0     0.0    15120.0   0.0
2012-08-07   5400.0   5400.0   5400.0   5400.0     0.0     5400.0   0.0
2012-08-08   5400.0   5400.0   5400.0   5400.0     0.0     5400.0   0.0
2012-08-09  16200.0  16200.0  16200.0  16200.0     0.0    16200.0   0.0

##### b) High와 Low의 차이를 계산해서 Diff라는 이름의 칼럼을 만들어 그 결과를 반영하시오.

In [90]:
panel_data['Diff'] = panel_data['High'] - panel_data['Low']

In [91]:
panel_data.head()

               High      Low     Open    Close  Volume  Adj Close  Diff
Date
2012-08-03  15120.0  15120.0  15120.0  15120.0     0.0    15120.0   0.0
2012-08-06  15120.0  15120.0  15120.0  15120.0     0.0    15120.0   0.0
2012-08-07   5400.0   5400.0   5400.0   5400.0     0.0     5400.0   0.0
2012-08-08   5400.0   5400.0   5400.0   5400.0     0.0     5400.0   0.0
2012-08-09  16200.0  16200.0  16200.0  16200.0     0.0    16200.0   0.0

##### c) 2015년의 Open, High, Low, Close의 각 평균을 구하시오

In [96]:
panel_data.loc[[idx for idx in panel_data.index if idx.year == 2015]].mean()

High         27474.642857
Low          24882.928571
Open         26326.571429
Close        25974.714286
Volume           7.142857
Adj Close    25974.714286
Diff          2591.714286
dtype: float64

## 참고자료 

 * [1] 데이터/수치 분석을 위한 파이썬 라이브러리 SciPy와 NumPy - http://www.hanbit.co.kr/ebook/look.html?isbn=9788968486135
 * [2] 파이썬 라이브러리를 활용한 데이터 분석 - http://www.hanbit.co.kr/book/look.html?isbn=978-89-6848-047-8
 * [3] Python for Finance - http://shop.oreilly.com/product/0636920032441.do